api/booking/cancel.json

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>...</soap:Header>
  <soap:Body>
    <CancelBookingRequest xmlns="http://webservices.micros.com/ows/5.1/Reservation.wsdl">

      <HotelReference chainCode="WC" hotelCode="SEFIVE"/>

      <ConfirmationNumber type="INTERNAL">4625769</ConfirmationNumber>

      <CancelTerm cancelType="Cancel" cancelReasonCode="WEB">
        <CancelReason>
          <Text>Guest changed plans</Text>
        </CancelReason>
      </CancelTerm>

    </CancelBookingRequest>
  </soap:Body>
</soap:Envelope>
